yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al31e88.h
/* DAC channel 1 data output register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DORH00      : 1;
  unsigned char DORH10      : 1;
  unsigned char DORH20      : 1;
  unsigned char DORH30      : 1;
} __BITS_DAC_CH1DORH;
#endif
__IO_REG8_BIT(DAC_CH1DORH, 0x53AC, __READ_WRITE, __BITS_DAC_CH1DORH);

/* DAC channel 1 data output register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DORL00      : 1;
  unsigned char DORL10      : 1;
  unsigned char DORL20      : 1;
  unsigned char DORL30      : 1;
  unsigned char DORL40      : 1;
  unsigned char DORL50      : 1;
  unsigned char DORL60      : 1;
  unsigned char DORL70      : 1;
} __BITS_DAC_CH1DORL;
#endif
__IO_REG8_BIT(DAC_CH1DORL, 0x53AD, __READ_WRITE, __BITS_DAC_CH1DORL);

/* DAC channel 2 data output register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DORH00      : 1;
  unsigned char DORH10      : 1;
  unsigned char DORH20      : 1;
  unsigned char DORH30      : 1;
} __BITS_DAC_CH2DORH;
#endif
__IO_REG8_BIT(DAC_CH2DORH, 0x53B0, __READ_WRITE, __BITS_DAC_CH2DORH);

/* DAC channel 2 data output register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DORL00      : 1;
  unsigned char DORL10      : 1;
  unsigned char DORL20      : 1;
  unsigned char DORL30      : 1;
  unsigned char DORL40      : 1;
  unsigned char DORL50      : 1;
  unsigned char DORL60      : 1;
  unsigned char DORL70      : 1;
} __BITS_DAC_CH2DORL;
#endif
__IO_REG8_BIT(DAC_CH2DORL, 0x53B1, __READ_WRITE, __BITS_DAC_CH2DORL);


/*-------------------------------------------------------------------------
 *      DAC bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define DAC_CH1CR1_EN            DAC_CH1CR1_bit.EN
#define DAC_CH1CR1_BOFF          DAC_CH1CR1_bit.BOFF
#define DAC_CH1CR1_TEN           DAC_CH1CR1_bit.TEN
#define DAC_CH1CR1_TSEL          DAC_CH1CR1_bit.TSEL
#define DAC_CH1CR1_WAVEN         DAC_CH1CR1_bit.WAVEN

#define DAC_CH1CR2_MAMP          DAC_CH1CR2_bit.MAMP
#define DAC_CH1CR2_DMAEN         DAC_CH1CR2_bit.DMAEN
#define DAC_CH1CR2_DMAUDRIE      DAC_CH1CR2_bit.DMAUDRIE

#define DAC_CH2CR1_EN            DAC_CH2CR1_bit.EN
#define DAC_CH2CR1_BOFF          DAC_CH2CR1_bit.BOFF
#define DAC_CH2CR1_TEN           DAC_CH2CR1_bit.TEN
#define DAC_CH2CR1_TSEL          DAC_CH2CR1_bit.TSEL
#define DAC_CH2CR1_WAVEN         DAC_CH2CR1_bit.WAVEN

#define DAC_CH2CR2_MAMP          DAC_CH2CR2_bit.MAMP
#define DAC_CH2CR2_DMAEN         DAC_CH2CR2_bit.DMAEN
#define DAC_CH2CR2_DMAUDRIE      DAC_CH2CR2_bit.DMAUDRIE

#define DAC_SWTRIG_SWTRIG1       DAC_SWTRIG_bit.SWTRIG1
#define DAC_SWTRIG_SWTRIG2       DAC_SWTRIG_bit.SWTRIG2

#define DAC_SR_DMAUDR1           DAC_SR_bit.DMAUDR1
#define DAC_SR_DMAUDR2           DAC_SR_bit.DMAUDR2

#define DAC_CH1RDHRH_RDHRH00     DAC_CH1RDHRH_bit.RDHRH00
#define DAC_CH1RDHRH_RDHRH10     DAC_CH1RDHRH_bit.RDHRH10
#define DAC_CH1RDHRH_RDHRH20     DAC_CH1RDHRH_bit.RDHRH20
#define DAC_CH1RDHRH_RDHRH30     DAC_CH1RDHRH_bit.RDHRH30

#define DAC_CH1RDHRL_RDHRL00     DAC_CH1RDHRL_bit.RDHRL00
#define DAC_CH1RDHRL_RDHRL10     DAC_CH1RDHRL_bit.RDHRL10
#define DAC_CH1RDHRL_RDHRL20     DAC_CH1RDHRL_bit.RDHRL20
#define DAC_CH1RDHRL_RDHRL30     DAC_CH1RDHRL_bit.RDHRL30
#define DAC_CH1RDHRL_RDHRL40     DAC_CH1RDHRL_bit.RDHRL40
#define DAC_CH1RDHRL_RDHRL50     DAC_CH1RDHRL_bit.RDHRL50
#define DAC_CH1RDHRL_RDHRL60     DAC_CH1RDHRL_bit.RDHRL60
#define DAC_CH1RDHRL_RDHRL70     DAC_CH1RDHRL_bit.RDHRL70

#define DAC_CH1LDHRH_LDHRH00     DAC_CH1LDHRH_bit.LDHRH00
#define DAC_CH1LDHRH_LDHRH10     DAC_CH1LDHRH_bit.LDHRH10
#define DAC_CH1LDHRH_LDHRH20     DAC_CH1LDHRH_bit.LDHRH20
#define DAC_CH1LDHRH_LDHRH30     DAC_CH1LDHRH_bit.LDHRH30
#define DAC_CH1LDHRH_LDHRH40     DAC_CH1LDHRH_bit.LDHRH40
#define DAC_CH1LDHRH_LDHRH50     DAC_CH1LDHRH_bit.LDHRH50
#define DAC_CH1LDHRH_LDHRH60     DAC_CH1LDHRH_bit.LDHRH60
#define DAC_CH1LDHRH_LDHRH70     DAC_CH1LDHRH_bit.LDHRH70

#define DAC_CH1LDHRL_LDHRL4      DAC_CH1LDHRL_bit.LDHRL4
#define DAC_CH1LDHRL_LDHRL5      DAC_CH1LDHRL_bit.LDHRL5
#define DAC_CH1LDHRL_LDHRL6      DAC_CH1LDHRL_bit.LDHRL6
#define DAC_CH1LDHRL_LDHRL7      DAC_CH1LDHRL_bit.LDHRL7

#define DAC_CH1DHR8_DHR00        DAC_CH1DHR8_bit.DHR00
#define DAC_CH1DHR8_DHR10        DAC_CH1DHR8_bit.DHR10
#define DAC_CH1DHR8_DHR20        DAC_CH1DHR8_bit.DHR20
#define DAC_CH1DHR8_DHR30        DAC_CH1DHR8_bit.DHR30
#define DAC_CH1DHR8_DHR40        DAC_CH1DHR8_bit.DHR40
#define DAC_CH1DHR8_DHR50        DAC_CH1DHR8_bit.DHR50
#define DAC_CH1DHR8_DHR60        DAC_CH1DHR8_bit.DHR60
#define DAC_CH1DHR8_DHR70        DAC_CH1DHR8_bit.DHR70

#define DAC_CH2RDHRH_RDHRH00     DAC_CH2RDHRH_bit.RDHRH00
#define DAC_CH2RDHRH_RDHRH10     DAC_CH2RDHRH_bit.RDHRH10
#define DAC_CH2RDHRH_RDHRH20     DAC_CH2RDHRH_bit.RDHRH20
#define DAC_CH2RDHRH_RDHRH30     DAC_CH2RDHRH_bit.RDHRH30

#define DAC_CH2RDHRL_RDHRL00     DAC_CH2RDHRL_bit.RDHRL00
#define DAC_CH2RDHRL_RDHRL10     DAC_CH2RDHRL_bit.RDHRL10
#define DAC_CH2RDHRL_RDHRL20     DAC_CH2RDHRL_bit.RDHRL20
#define DAC_CH2RDHRL_RDHRL30     DAC_CH2RDHRL_bit.RDHRL30
#define DAC_CH2RDHRL_RDHRL40     DAC_CH2RDHRL_bit.RDHRL40
#define DAC_CH2RDHRL_RDHRL50     DAC_CH2RDHRL_bit.RDHRL50
#define DAC_CH2RDHRL_RDHRL60     DAC_CH2RDHRL_bit.RDHRL60
#define DAC_CH2RDHRL_RDHRL70     DAC_CH2RDHRL_bit.RDHRL70

#define DAC_CH2LDHRH_LDHRH00     DAC_CH2LDHRH_bit.LDHRH00
#define DAC_CH2LDHRH_LDHRH10     DAC_CH2LDHRH_bit.LDHRH10
#define DAC_CH2LDHRH_LDHRH20     DAC_CH2LDHRH_bit.LDHRH20
#define DAC_CH2LDHRH_LDHRH30     DAC_CH2LDHRH_bit.LDHRH30
#define DAC_CH2LDHRH_LDHRH40     DAC_CH2LDHRH_bit.LDHRH40
#define DAC_CH2LDHRH_LDHRH50     DAC_CH2LDHRH_bit.LDHRH50
#define DAC_CH2LDHRH_LDHRH60     DAC_CH2LDHRH_bit.LDHRH60
#define DAC_CH2LDHRH_LDHRH70     DAC_CH2LDHRH_bit.LDHRH70

#define DAC_CH2LDHRL_LDHRL4      DAC_CH2LDHRL_bit.LDHRL4
#define DAC_CH2LDHRL_LDHRL5      DAC_CH2LDHRL_bit.LDHRL5
#define DAC_CH2LDHRL_LDHRL6      DAC_CH2LDHRL_bit.LDHRL6
#define DAC_CH2LDHRL_LDHRL7      DAC_CH2LDHRL_bit.LDHRL7

#define DAC_CH2DHR8_DHR00        DAC_CH2DHR8_bit.DHR00
#define DAC_CH2DHR8_DHR10        DAC_CH2DHR8_bit.DHR10
#define DAC_CH2DHR8_DHR20        DAC_CH2DHR8_bit.DHR20
#define DAC_CH2DHR8_DHR30        DAC_CH2DHR8_bit.DHR30
#define DAC_CH2DHR8_DHR40        DAC_CH2DHR8_bit.DHR40
#define DAC_CH2DHR8_DHR50        DAC_CH2DHR8_bit.DHR50
#define DAC_CH2DHR8_DHR60        DAC_CH2DHR8_bit.DHR60
#define DAC_CH2DHR8_DHR70        DAC_CH2DHR8_bit.DHR70

#define DAC_DCH1RDHRH_RDHRH00    DAC_DCH1RDHRH_bit.RDHRH00
#define DAC_DCH1RDHRH_RDHRH10    DAC_DCH1RDHRH_bit.RDHRH10
#define DAC_DCH1RDHRH_RDHRH20    DAC_DCH1RDHRH_bit.RDHRH20
#define DAC_DCH1RDHRH_RDHRH30    DAC_DCH1RDHRH_bit.RDHRH30

#define DAC_DCH1RDHRL_RDHRL00    DAC_DCH1RDHRL_bit.RDHRL00
#define DAC_DCH1RDHRL_RDHRL10    DAC_DCH1RDHRL_bit.RDHRL10
#define DAC_DCH1RDHRL_RDHRL20    DAC_DCH1RDHRL_bit.RDHRL20
#define DAC_DCH1RDHRL_RDHRL30    DAC_DCH1RDHRL_bit.RDHRL30
#define DAC_DCH1RDHRL_RDHRL40    DAC_DCH1RDHRL_bit.RDHRL40
#define DAC_DCH1RDHRL_RDHRL50    DAC_DCH1RDHRL_bit.RDHRL50
#define DAC_DCH1RDHRL_RDHRL60    DAC_DCH1RDHRL_bit.RDHRL60
#define DAC_DCH1RDHRL_RDHRL70    DAC_DCH1RDHRL_bit.RDHRL70

#define DAC_DORH_DORH            DAC_DORH_bit.DORH

#define DAC_DCH2RDHRH_RDHRH00    DAC_DCH2RDHRH_bit.RDHRH00
#define DAC_DCH2RDHRH_RDHRH10    DAC_DCH2RDHRH_bit.RDHRH10
#define DAC_DCH2RDHRH_RDHRH20    DAC_DCH2RDHRH_bit.RDHRH20
#define DAC_DCH2RDHRH_RDHRH30    DAC_DCH2RDHRH_bit.RDHRH30

#define DAC_DCH2RDHRL_RDHRL00    DAC_DCH2RDHRL_bit.RDHRL00
#define DAC_DCH2RDHRL_RDHRL10    DAC_DCH2RDHRL_bit.RDHRL10
#define DAC_DCH2RDHRL_RDHRL20    DAC_DCH2RDHRL_bit.RDHRL20
#define DAC_DCH2RDHRL_RDHRL30    DAC_DCH2RDHRL_bit.RDHRL30
#define DAC_DCH2RDHRL_RDHRL40    DAC_DCH2RDHRL_bit.RDHRL40
#define DAC_DCH2RDHRL_RDHRL50    DAC_DCH2RDHRL_bit.RDHRL50
#define DAC_DCH2RDHRL_RDHRL60    DAC_DCH2RDHRL_bit.RDHRL60
#define DAC_DCH2RDHRL_RDHRL70    DAC_DCH2RDHRL_bit.RDHRL70

#define DAC_DCH1LDHRH_LDHRH00    DAC_DCH1LDHRH_bit.LDHRH00
#define DAC_DCH1LDHRH_LDHRH10    DAC_DCH1LDHRH_bit.LDHRH10
#define DAC_DCH1LDHRH_LDHRH20    DAC_DCH1LDHRH_bit.LDHRH20
#define DAC_DCH1LDHRH_LDHRH30    DAC_DCH1LDHRH_bit.LDHRH30
#define DAC_DCH1LDHRH_LDHRH40    DAC_DCH1LDHRH_bit.LDHRH40
#define DAC_DCH1LDHRH_LDHRH50    DAC_DCH1LDHRH_bit.LDHRH50
#define DAC_DCH1LDHRH_LDHRH60    DAC_DCH1LDHRH_bit.LDHRH60
#define DAC_DCH1LDHRH_LDHRH70    DAC_DCH1LDHRH_bit.LDHRH70

